Tekla Open API Reference for Tekla Structures 2025
SectionMarkSymbol Properties
The SectionMarkBase.SectionMarkSymbol type exposes the following members.
Properties
Name | Description
Position
 The position of the section mark symbol.
Shape
 The shape of the section mark symbol.
Size
 The size of the section mark symbol.
Top
See Also
Reference
SectionMarkBase.SectionMarkSymbol Class
Tekla.Structures.Drawing Namespace